# GetInsulationIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InsulationLiningBase..::..GetInsulationIds Method
InsulationLiningBase Class See Also
---
Returns the ids of the insulation elements associated to a given element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static ICollection<ElementId> GetInsulationIds(
	Document document,
	ElementId elemId
)
```

Visual Basic
---
```text
Public Shared Function GetInsulationIds ( _
	document As Document, _
	elemId As ElementId _
) As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
static ICollection<ElementId^>^ GetInsulationIds(
	Document^ document,
	ElementId^ elemId
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
elemId
    Type: Autodesk.Revit.DB..::..ElementId The element.
# ### Return Value
A collection of the ids of the insulation elements.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | This id does not represent a valid host for insulation. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
InsulationLiningBase Class
Autodesk.Revit.DB Namespace